app/controllers/catalogs/comment_types_controller.rb

SELECT "catalogs_comment_types".* FROM "catalogs_comment_types"
---
  def index
    @catalogs_comment_types = Catalogs::CommentType.all

SELECT "catalogs_comment_types".* FROM "catalogs_comment_types" WHERE ("catalogs_comment_types"."id" = 1) LIMIT 1
---
  def show
    @catalogs_comment_type = Catalogs::CommentType.find(params[:id])

SELECT "catalogs_comment_types".* FROM "catalogs_comment_types" WHERE ("catalogs_comment_types"."id" = 1) LIMIT 1
---
  def edit
    @catalogs_comment_type = Catalogs::CommentType.find(params[:id])

INSERT INTO "catalogs_comment_types" ("abbr", "created_at", "description", "updated_at") VALUES ('CANC', '2010-09-05 21:28:01.894482', 'Cancelación de solicitud', '2010-09-05 21:28:01.894482') RETURNING "id"
---
  def create
    @catalogs_comment_type = Catalogs::CommentType.new(params[:catalogs_comment_type])

    respond_to do |format|
      if @catalogs_comment_type.save