app/controllers/catalogs/priorities_controller.rb

INSERT INTO "catalogs_priorities" ("abbr", "created_at", "description", "updated_at") VALUES ('URG', '2010-09-05 21:37:40.130982', 'Urgente', '2010-09-05 21:37:40.130982') RETURNING "id"
---
  def create
    @catalogs_priority = Catalogs::Priority.new(params[:catalogs_priority])

    respond_to do |format|
      if @catalogs_priority.save