app/controllers/catalogs/request_statuses_controller.rb

SELECT "catalogs_request_statuses".* FROM "catalogs_request_statuses"
---
  def index
    @catalogs_request_statuses = Catalogs::RequestStatus.all

SELECT "catalogs_request_statuses".* FROM "catalogs_request_statuses" WHERE ("catalogs_request_statuses"."id" = 1) LIMIT 1
---
  def show
    @catalogs_request_status = Catalogs::RequestStatus.find(params[:id])

SELECT "catalogs_request_statuses".* FROM "catalogs_request_statuses" WHERE ("catalogs_request_statuses"."id" = 1) LIMIT 1
---
  def edit
    @catalogs_request_status = Catalogs::RequestStatus.find(params[:id])

INSERT INTO "catalogs_request_statuses" ("abbr", "created_at", "description", "updated_at") VALUES ('INI', '2010-09-05 22:07:31.252137', 'Iniciado', '2010-09-05 22:07:31.252137') RETURNING "id"
---
  def create
    @catalogs_request_status = Catalogs::RequestStatus.new(params[:catalogs_request_status])

    respond_to do |format|
      if @catalogs_request_status.save