app/controllers/catalogs/support_types_controller.rb

  def index
    @catalogs_support_types = Catalogs::SupportType.all
---
SELECT "catalogs_support_types".* FROM "catalogs_support_types"

  def show
    @catalogs_support_type = Catalogs::SupportType.find(params[:id])
---
SELECT "catalogs_support_types".* FROM "catalogs_support_types" WHERE ("catalogs_support_types"."id" = 1) LIMIT 1

  def edit
    @catalogs_support_type = Catalogs::SupportType.find(params[:id])
---
SELECT "catalogs_support_types".* FROM "catalogs_support_types" WHERE ("catalogs_support_types"."id" = 1) LIMIT 1

  def create
    @catalogs_support_type = Catalogs::SupportType.new(params[:catalogs_support_type])

    respond_to do |format|
      if @catalogs_support_type.save
---
INSERT INTO "catalogs_support_types" ("abbr", "created_at", "name", "updated_at") VALUES ('MTTO', '2010-08-19 16:18:53.895726', 'Mantenimiento en general', '2010-08-19 16:18:53.895726') RETURNING "id"

  def destroy
    @catalogs_support_type = Catalogs::SupportType.find(params[:id])
    @catalogs_support_type.destroy
---
SELECT "catalogs_support_types".* FROM "catalogs_support_types" WHERE ("catalogs_support_types"."id" = 2) LIMIT 1
DELETE FROM "catalogs_support_types" WHERE ("catalogs_support_types"."id" = 2)