app/controllers/catalogs/ubications_controller.rb

INSERT INTO "catalogs_ubications" ("abbr", "created_at", "name", "responsible", "tel_ext", "unit_id", "updated_at") VALUES ('UCOM', '2010-08-19 19:12:42.249820', 'Unidad de Cómputo', 'Ramón Martínez Olvera', '34052', NULL, '2010-08-19 19:12:42.249820') RETURNING "id"
---
  def create
    @catalogs_ubication = Catalogs::Ubication.new(params[:catalogs_ubication])

    respond_to do |format|
      if @catalogs_ubication.save

UPDATE "catalogs_ubications" SET "unit_id" = 1, "updated_at" = '2010-08-19 19:23:54.951498' WHERE ("catalogs_ubications"."id" = 1)
---
  def update
    @catalogs_ubication = Catalogs::Ubication.find(params[:id])
    #@catalogs_ubication.attributes = params[:catalogs_ubication]
    #if @catalogs_ubication.available == "1"
    #   @catalogs_ubication.available = "1"
    #else
    #   @catalogs_ubication.available = nil
    #end

    respond_to do |format|
      if @catalogs_ubication.update_attributes(params[:catalogs_ubication])