app/controllers/catalogs/units_controller.rb

  def create
    @catalogs_unit = Catalogs::Unit.new(params[:catalogs_unit])

    respond_to do |format|
      if @catalogs_unit.save
---
INSERT INTO "catalogs_units" ("abbr", "created_at", "name", "updated_at") VALUES ('INB', '2010-08-19 18:09:12.086897', 'Instituto de Neurobiología', '2010-08-19 18:09:12.086897') RETURNING "id"