app/views/administration/user_hierachies/_form.html.erb

SELECT "administration_user_hierachies".* FROM "administration_user_hierachies" WHERE ("administration_user_hierachies"."id" = 3) LIMIT 1
---
    <%= f.label :Usuario %><br />
    <%= select :administration_user_hierachy , :user_id, Administration::User.find(:all).collect{|p| [p.name, p.id]}%>