app/views/requests/support_requests/_form.html.erb

      <td align="left">
        <%= select :requests_support_request , :ubication_id, Catalogs::Ubication.find(:all).collect{|p| [p.name, p.id]}%>
---
SELECT "requests_support_requests".* FROM "requests_support_requests" WHERE ("requests_support_requests"."id" = 1) LIMIT 1