app/views/administration/users/_form.html.erb

SELECT "administration_user_roles"."id", "administration_user_roles"."rol", "administration_user_roles"."description", "administration_user_roles"."created_at", "administration_user_roles"."updated_at" FROM "administration_user_roles" WHERE ("administration_user_roles"."id" = 1) LIMIT 1
SELECT "administration_users".* FROM "administration_users" WHERE ("administration_users"."id" = 1) LIMIT 1
---
      <td>
        <%= select :administration_user , :role_id, Administration::UserRole.find(:all).collect{|p| [p.description, p.id]}%>