app/controllers/administration/users_controller.rb

SELECT "administration_user_hierachies".* FROM "administration_user_hierachies" WHERE ("administration_user_hierachies"."id" = -616532738) LIMIT 1
---
  def show
    @administration_user = Administration::User.find(params[:id])
    @administration_user_hierachies = Administration::UserHierachy.find( :all, :conditions => ['"user_id" = ?', params[:id]] )

INSERT INTO "administration_users" ("created_at", "crypted_password", "email", "name", "password_salt", "persistence_token", "role_id", "ubication_id", "updated_at", "username") VALUES ('2010-09-05 23:42:31.544775', '6f5749201ad170ccce152b0d5d17b8bc4c9598385d54c7c588c6ce4f17e4d44d68f4f54c43dbf006da346ba23af165e055951ff1b5a702cdd51fd06083d8ac9b', 'martinezo@inb.unam.mx', 'Ramon Martínez Olvera', 'bli23ttL_zPtQ-i4kHMl', '33634fed088155f5674f14f6479ad81843b6b3e4ec880433c2c55306ef4ffc34b7ad957663f009ff190d548e8bf7cc38c2d0cd32dd5e854c9337387cf9c48ecd', NULL, NULL, '2010-09-05 23:42:31.544775', 'martinezo') RETURNING "id"
---
  def create
    @administration_user = Administration::User.new(params[:administration_user])

    respond_to do |format|
      if @administration_user.save

UPDATE "administration_users" SET "crypted_password" = 'f345c63ac327347e220aef3c7c2ff4916babd4f7536d6ec43144e2299889541f3a719f646126fa962771bb03f89450b4cd3b99e4650bac569c7cf4641a330aad', "password_salt" = '_3cH3oO85fG2j6llh8dE', "persistence_token" = 'c6fa4cb9ef2431c8969e4edda9fc9a83ac0414d7eb0f2db774919f0eb99d08d4faeb56c1b997fae0fe6c2d57483c1ddd5029a6ded813012c838c35fea137a2fd', "updated_at" = '2010-09-06 01:09:28.096971' WHERE ("administration_users"."id" = 1)
---
  def update
    @administration_user = Administration::User.find(params[:id])

    respond_to do |format|
      if @administration_user.update_attributes(params[:administration_user])