app/controllers/administration/user_hierachies_controller.rb

  def index
    @administration_user_hierachies = Administration::UserHierachy.all
---
SELECT "administration_user_hierachies".* FROM "administration_user_hierachies"

  def show
    @administration_user_hierachy = Administration::UserHierachy.find(params[:id])
---
SELECT "administration_user_hierachies".* FROM "administration_user_hierachies" WHERE ("administration_user_hierachies"."id" = 1) LIMIT 1

  def edit
    @administration_user_hierachy = Administration::UserHierachy.find(params[:id])
---
SELECT "administration_user_hierachies".* FROM "administration_user_hierachies" WHERE ("administration_user_hierachies"."id" = 3) LIMIT 1

  def create
    @administration_user_hierachy = Administration::UserHierachy.new(params[:administration_user_hierachy])

    respond_to do |format|
      if @administration_user_hierachy.save
---
INSERT INTO "administration_user_hierachies" ("created_at", "helper_id", "updated_at", "user_id") VALUES ('2010-08-29 17:49:05.119414', NULL, '2010-08-29 17:49:05.119414', NULL) RETURNING "id"