app/controllers/administration/user_roles_controller.rb

  def index

    if lv_role = Administration::UserSession.find.record.attributes['role']!= 'ADMIN'
      redirect_to requests_administration_support_requests_path
      return
    end
    @administration_user_roles = Administration::UserRole.all
---
SELECT "administration_user_roles".* FROM "administration_user_roles"

  def show
    @administration_user_role = Administration::UserRole.find(params[:id])
---
SELECT "administration_user_roles".* FROM "administration_user_roles" WHERE ("administration_user_roles"."id" = 1) LIMIT 1

  def create
    @administration_user_role = Administration::UserRole.new(params[:administration_user_role])

    respond_to do |format|
      if @administration_user_role.save
---
INSERT INTO "administration_user_roles" ("created_at", "description", "rol", "updated_at") VALUES ('2010-09-05 23:45:26.928650', 'Administrador', 'ADM', '2010-09-05 23:45:26.928650') RETURNING "id"