app/views/catalogs/ubications/_form.html.erb

      <td>
        <%= select :catalogs_ubication , :unit_id, Catalogs::Unit.find(:all).collect{|p| [p.name, p.id]}%>
---
SELECT "catalogs_ubications".* FROM "catalogs_ubications" WHERE ("catalogs_ubications"."id" = 1) LIMIT 1