app/controllers/requests/req_delegations_controller.rb

SELECT "requests_req_delegations".* FROM "requests_req_delegations"
---
  def index
    @requests_req_delegations = Requests::ReqDelegation.all