app/controllers/requests/request_commentaries_controller.rb

  def index
    @requests_request_commentaries = Requests::RequestCommentary.all
---
SELECT "requests_request_commentaries".* FROM "requests_request_commentaries"