app/controllers/requests/support_requests_controller.rb

SELECT "requests_support_requests".* FROM "requests_support_requests" WHERE ("requests_support_requests"."id" = 1) LIMIT 1
---
  def show
    @requests_support_request = Requests::SupportRequest.find(params[:id])

SELECT "requests_support_requests".* FROM "requests_support_requests" WHERE ("requests_support_requests"."id" = 1) LIMIT 1
---
  def edit
    @requests_support_request = Requests::SupportRequest.find(params[:id])

INSERT INTO "requests_support_requests" ("created_at", "description", "email", "helper_id", "name", "request_no", "status_chng_date", "status_id", "support_type_id", "tech_description", "ubication_id", "updated_at") VALUES ('2010-09-09 04:33:32.034354', 'Esta es una prueba', 'rmartinez1006@prodigy.net.mx', NULL, 'Roberto Martínez Olvera', 1284006812, '2010-09-09 04:33:32.034283', 1, NULL, NULL, 1, '2010-09-09 04:33:32.034354') RETURNING "id"
---
  def create
    @requests_support_request = Requests::SupportRequest.new(params[:requests_support_request])

    respond_to do |format|
      if @requests_support_request.save

SELECT "requests_support_requests".* FROM "requests_support_requests" WHERE ("requests_support_requests"."id" = 1) LIMIT 1
UPDATE "requests_support_requests" SET "description" = 'Esta es una prueba de Solicitud de Soporte Tecnico, información necesaria para iniciar proceso.', "updated_at" = '2010-09-09 04:45:08.085615' WHERE ("requests_support_requests"."id" = 1)
---
  def update
    @requests_support_request = Requests::SupportRequest.find(params[:id])
    @requests_support_request.attributes = params[:requests_support_request]

    respond_to do |format|

      if not @requests_support_request.errordatos()
          if @requests_support_request.update_attributes(params[:requests_support_request])

SELECT "requests_support_requests".* FROM "requests_support_requests" WHERE ("requests_support_requests"."id" = 1) LIMIT 1
DELETE FROM "requests_support_requests" WHERE ("requests_support_requests"."id" = 1)
---
  def destroy
    @requests_support_request = Requests::SupportRequest.find(params[:id])
    @requests_support_request.destroy